
package com.cloudbest.common.domain;


/**
 * 异常编码 0成功、-1熔断、 -2 标准参数校验不通过 -3会话超时
 * 前两位:服务标识
 * 中间两位:模块标识
 * 后两位:异常标识
 */
public enum CommonErrorCode implements ErrorCode {
	SUCCESS(true,100000,"操作成功!"),
	//---系统错误返回码-----
	FAIL(false,999999,"操作失败"),
	////////////////////////////////////用户异常编码 //////////////////////////
	E_900101(900101,"地址ID为空"),
	E_900102(900102,"验证码错误"),
	E_900103(900103,"验证码为空"),
	E_900104(900104,"查询结果为空"),
	E_900105(900105,"ID格式不正确或超出Long存储范围"),
	E_900106(900106,"上传错误"),
	E_900107(900107,"发送验证码错误"),
	E_900108(900108,"该手机号未注册"),
	E_900109(900109,"今日输错密码超过10次，账号暂时被冻结，请明日再进行尝试"),
	E_900110(900110,"用户名为空"),
	E_900111(900111,"密码为空"),
	E_900112(900112,"手机号为空"),
	E_900113(900113,"手机号已存在"),
	E_900114(900114,"用户名已存在"),
	E_900115(900115,"密码不正确"),
	E_900116(900116,"地址为空"),
	E_900117(900117,"用户ID为空"),
	E_900118(900118,"未找到该用户"),
	E_900119(900119,"新密码为空"),
	E_900120(900120,"用户收藏为空"),
	E_900121(900121,"token验证失败"),
	E_900122(900122,"手机号码或密码为空"),
	E_900123(900123,"手机号码格式不正确"),
	E_900124(900124,"身份证验证失败"),
	E_900125(900125,"姓名为空"),
	E_900126(900126,"用户对象为空"),
	E_900127(900127,"手机号码与密码不匹配"),
	E_900128(900128,"新密码与旧密码相同"),
	E_900129(900129,"登陆信息为空"),
	E_900130(900130,"身份证号已存在"),
	E_900131(900131,"今日已经发送十次，请明日再进行尝试"),
	E_900132(900132,"请30秒后再尝试发送"),
	E_900133(900133,"无用户绑定信息"),
	E_900134(900134,"验证码超时"),
	E_900135(900135,"用户绑定失败"),

	////////////////////////////////////公用异常编码 //////////////////////////



	////////////////////////////////////商品模块异常编码901XXX//////////////////
	E_901001(901001,"原商品信息不存在"),
	E_901002(901002,"原商品分类信息不存在"),
	E_901003(901003,"原仓库信息不存在"),
	E_901004(901004,"原库存信息不存在"),
	E_901005(901005,"原商品图片信息不存在"),
	E_901006(901006,"原供应商信息不存在"),
	E_901007(901007,"未接收到商品图片"),
	E_901008(901008,"本商品没有对应的sku"),
	E_901009(901009,"本商品没有对应的图片"),
	E_901010(901010,"本商品仓库不可用"),

	////////////////////////////////////SAAS服务异常编码110 //////////////////////////
	E_110001(110001,"账号不存在"),
	E_110002(110002,"角色编码在同一租户中已存在，不可重复"),
	E_110003(110003,"角色为空"),
	E_110004(110004,"角色已绑定账号，被使用中不可删除"),
	E_110005(110005,"权限集合为空"),
	E_110006(110006,"参数为空"),
	E_110007(110007,"未查询到租户关联的角色"),
	E_110008(110008,"账号被其他租户使用，不可删除"),

	////////////////////////////////////商户服务异常编码200//////////////////////////
	E_200001(200001,"企业名称不能为空"),
	E_200002(200002,"商户不存在"),
	E_200003(200003,"商户还未通过认证审核，不能创建应用"),
	E_200004(200004,"应用名称已经存在，请使用其他名称"),
	E_200005(200005,"应用不属于当前商户"),
	E_200006(200006,"门店不属于当前商户"),
	E_200007(200007,"二维码生成失败"),
	E_200008(200008,"授权码为空"),
	E_200009(200009,"订单标题为空"),
	E_200010(200010,"订单金额为空"),
	E_200011(200011,"授权码格式有误"),
	E_200012(200012,"租户不存在"),
	E_200013(200013,"员工不存在"),
	E_200014(200014,"商户下未设置根门店"),
	E_200015(200015,"未查询到该门店"),
	E_200016(200016,"资质申请已通过，无需重复申请"),
	E_200017(200017,"商户在当前租户下已经注册，不可重复注册"),




	////////////////////////////////////交易服务异常编码300//////////////////////////
	E_300001(300001,"支付金额为空"),
	E_300002(300002,"openId为空"),
	E_300003(300003,"appId为空"),
	E_300004(300004,"商户id为空"),
	E_300005(300005,"服务类型编码为空"),
	E_300006(300006,"订单金额转换异常"),
	E_300007(300007,"原始支付渠道为空"),
	E_300008(300008,"已存在相同的支付参数，不可重复配置"),
	E_300009(300009,"传入对象为空或者缺少必要的参数"),
	E_300010(300010,"应用没有绑定服务类型，不允许配置参数"),

	E_300110(300110,"交易单号不能为空"),
	E_310000(1,"待支付"),
	E_320000(2,"待收货"),
	E_330000(3,"已完成"),
	E_340000(4,"已取消"),

	E_300120(300120,"输入的订单号不存在"),
	E_300121(300121,"创建订单失败"),
	E_300122(300122,"更新订单失败"),
	E_300123(300123,"商品价格对不上"),
	E_300124(300124,"购物券不足"),
	E_300125(300125,"该笔订单已支付完成，请勿重复提交"),







	////////////////////////////////////支付渠道代理服务异常编码400//////////////////
	E_400001(400001,"微信确认支付失败"),
	E_400002(400002,"支付宝确认支付失败"),

	////////////////////////////////////运营服务异常编码500//////////////////

	////////////////////////////////////特殊异常编码/////////////////////////////////////
	E_999991(999991,"调用微服务-授权服务 被熔断"),
	E_999992(999992,"调用微服务-用户服务 被熔断"),
	E_999993(999993,"调用微服务-资源服务 被熔断"),
	E_999994(999994,"调用微服务-同步服务 被熔断"),

	E_999910(999910,"调用微服务-没有传tenantId租户Id"),
	E_999911(999911,"调用微服务-没有json-token令牌"),
	E_999912(999912,"调用微服务-json-token令牌解析有误"),
	E_999913(999913,"调用微服务-json-token令牌有误-没有当前租户信息"),
	E_999914(999914,"调用微服务-json-token令牌有误-该租户下没有权限信息"),

	E_NO_AUTHORITY(999997,"没有访问权限"),
	CUSTOM(999998,"自定义异常"),
	/**
	 * 未知错误
	 */
	UNKNOWN(999999,"未知错误");


	int code;
	String desc;
	boolean success;

	public boolean isSuccess() {
		return success;
	}

	public int getCode() {
		return code;
	}

	public String getDesc() {
		return desc;
	}

	CommonErrorCode(boolean success,int code, String desc) {
		this.success=success;
		this.code = code;
		this.desc = desc;
	}
	private CommonErrorCode(int code, String desc) {
		this.code = code;
		this.desc = desc;
	}


	public static CommonErrorCode setErrorCode(int code) {
		for (CommonErrorCode errorCode : CommonErrorCode.values()) {
			if (errorCode.getCode()==code) {
				return errorCode;
			}
		}
		return null;
	}
}
